/* 
   AlertDialog.strings
   Taskation

   Created by Lyndsey on 1/18/09.
   Copyright 2009 Lyndsey D. Ferguson. All rights reserved.
 */

/* When an Action or Subject string does not exist */

	/* Dialog Titles */
	
	"UnknownSubjectDialogTitle" = "Unknown Subject";

	"UnknownActionSubjectDialogTitle" = "Unknown Action and Subject";

	/* Dialog Message Text */

	"UnknownSubjectDialogMessage" = "The given subject \"%@\" doesn\'t exist. Do you wish to add it?";

	"UnknownActionSubjectDialogMessage" = "The given action \"%@\" and subject \"%@\" don\'t exist. Do you wish to add them?";

	/* Dialog Button Text */
	
	"UnknownSubjectDialogDefaultButton" = "Add Subject";
	
	"UnknownActionSubjectDialogDefaultButton" = "Add Action and Subject";
	
	"UnknownActionSubjectDialogCancelButton" = "Cancel";
	
/* Action and Subjects Preference Strings */

	"AllSubjectsActionPlaceholder" = "All Subjects";
	
	"UnknownAction#" = "Unknown Action %d";
	
/* Alert user that file has not been saved. */

	"SaveDocumentButton" = "Save";
	
	"DontSaveDocumentButton" = "Don't Save";
	
	"CancelCloseDocumentButton" = "Cancel";
	
	"SaveDocumentChangesAlert" = "Do you want to save the changes you made to the file \"%@\"?";

	"SaveDocumentChangesAdvice" = "Your changes will be lost if you don't save them.";
	
/* Journal Header Strings */

	"ActionHeaderString" = "Actions";
	
	"SubjectHeaderString" = "Subjects";
	
	"StartTimeHeaderString" = "Start Time";
	
	"EndTimeHeaderString" = "End Time";
	
	"ElapsedTimeHeaderString" = "Elapsed Time";
	
/* About Dialog Strings */
	"VersionLabelString" = "Version %@";
	
/* License Dialog Strings */
	"LicenseDialogAlertString" = "Registration Succeeded";
	
	"LicenseDialogThankYouString" = "Thank you for registering your Taskation license!";
	
	"LicenseDialogOKButtonString" = "OK";
	
/* Unlicensed Dialog Strings */
/*
Welcome! With this free version, you are entitled to make 20 entries before purchasing
*/
	"UnlicensedDialogAdviceString_FirstNotice" = "Welcome! With this unlicensed version, you are entitled to make 20 entries before purchasing.";
	
	"UnlicensedDialogAdviceString_SubsequentNotice" = "Sorry! Without a license you may not create more than 20 activities or 10 subjects.";
	